let x = 25; // Створюємо змінну з ім'ям "х" і присвоюємо їй значення 25
var y = 'Very long string'; // Створюємо змінну з ім'ям "у" і присвоюємо їй рядок 
const z = 100; // Створюємо постійну, незмінну з ім'ям "z" і присвоюємо їй значення 100
x = y - z; // Значення змінної "х" перезаписуємо результатом віднімання "z" з "у"
console.log('x = ' + x); // Виводимо в консоль отримане значення змінної "х"
// Виведеться х = NaN (Not a Number), тому що ми вичитали з рядка (у) число (z)

let s = y.length; // Створюємо змінну "s" і присвоюємо їй як значення число символів у значенні змінної "у" (довжину рядка "у")
console.log(s); // Виводимо в консоль значення змінної "s"
// Виведеться 16 (довжина рядка 'Very long string') 

let a; // Створюємо змінну з ім'ям "а" без надання їй значення
console.log(a); // Виводимо в консоль значення змінної "а"
// Виведеться undefined (невизначено), тому що змінна не має значення 
a = 'World'; // Присвоюємо змінної "а" рядок
console.log('Hello, ' + a + '!'); // Виводимо в консоль результат складання (конкатенації) рядків зі значенням змінної "а"
// Виведеться Hello, World!

console.log(x < z); // Виводимо в консоль результат перевірки значень змінних "х" та "z"
// Виведеться false (брехня), тому що змінна "х" має значення NaN
x = 25; // Знову присвоюємо значення 25 змінної "х"
console.log(x < z); // Виводимо в консоль результат перевірки значень змінних "х" та "z"
// Виведеться true (істина), тому що змінна "х" (25) менше ніж значення змінної "z" (100)

let b, d, f; // Створюємо три змінні без надання їм значень
b = d = f = 7 * z; // Присвоюємо створеним змінним однакове значення 7 * z
console.log(b); // Виведеться 700 (7 * 100)
console.log(d); // Виведеться 700
console.log(f); // Виведеться 700

d -= 50; // d = d - 50
console.log(d); // Виведеться 650 (700 - 50)

x++; // x = x + 1
console.log('x = ' + x); // Виведеться 26 (25 + 1)
x--; // x = x - 1
console.log('x = ' + x); // Виведеться 25 (26 - 1)

b = 1; // Перезаписуємо значення змінної "b" на 1
f = b++; // Перезаписуємо значення змінної "f" на b + 1. Порядок дій: f = b, b = b + 1 (постфіксний інкремент)
console.log('f = ' + f); // Виведеться f = 1
console.log('b = ' + b); // Виведеться b = 2

b = 1; // Перезаписуємо значення змінної "b" на 1
f = ++b; // Перезаписуємо значення змінної "f" на b + 1. Порядок дій: b = b + 1, f = b (префіксний інкремент)
console.log('f = ' + f); // Виведеться f = 2
console.log('b = ' + b); // Виведеться b = 2